ginkgo9914/STM32-servo-control/Submission_Poster/System/Tick.c
#include "stm32f10x.h"
// 该文件实现了系统滴答计时器，提供了初始化和获取时间戳的功能

// 该变量随时会变化
static volatile uint32_t tick_ms;
/**
 * @brief 初始化系统滴答计时器
 */
void Tick_Init(void)
{
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM3, ENABLE);

    TIM_InternalClockConfig(TIM3);
    
    TIM_TimeBaseInitTypeDef TIM_TimeBaseStructure;
    TIM_TimeBaseStructure.TIM_Period        = 1000 - 1;
    TIM_TimeBaseStructure.TIM_Prescaler     = 72 - 1;
    TIM_TimeBaseStructure.TIM_ClockDivision = TIM_CKD_DIV1;
    TIM_TimeBaseStructure.TIM_CounterMode   = TIM_CounterMode_Up;
    TIM_TimeBaseInit(TIM3, &TIM_TimeBaseStructure);
    
    TIM_ITConfig(TIM3, TIM_IT_Update, ENABLE);

    NVIC_InitTypeDef NVIC_InitStructure;
    NVIC_InitStructure.NVIC_IRQChannel                   = TIM3_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 2;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority        = 2;
    NVIC_InitStructure.NVIC_IRQChannelCmd                = ENABLE;
    NVIC_Init(&NVIC_InitStructure);

    TIM_Cmd(TIM3, ENABLE);
}

/**
 * @brief 获取时间戳
 */
uint32_t Tick_Get(void)
{
    return tick_ms;
}

/**
 * @brief 时间计时暂停
 */
void Tick_Pause(void){
    TIM_Cmd(TIM3, DISABLE);
}

/**
 * @brief 时间计时恢复
 */
void Tick_Resume(void){
    TIM_Cmd(TIM3, ENABLE);
}

/**
 * @brief TIM3中断
 */
void TIM3_IRQHandler(void)
{
    if (TIM_GetITStatus(TIM3, TIM_IT_Update) == SET) {
        tick_ms++;
        TIM_ClearITPendingBit(TIM3, TIM_IT_Update);
    }
}
